_org_posts/_posts/2021-12-18-abc228-c-upsolving.org
#+HTML: ---
#+HTML: title: C - Final Day
#+HTML: tags: AtCoder
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---
#+OPTIONS: ^:nil

** C - Final Day
3일까지 시험을 본 상태에서, 마지막 시험점수를 통해 K등에 들 수 있는지 알아보기
** 코드
#+BEGIN_SRC cpp
#include <cstdio>
#include <algorithm>
using namespace std;

int N, K;

typedef struct Node
{
    int score;
    int idx;
    int state;
} Node;

Node a[100010];

bool cmp1(const Node& p1, const Node& p2)
{
    return (p1.score > p2.score);
}

bool cmp2(const Node& p1, const Node& p2)
{
    return (p1.idx < p2.idx);
}

int main(int argc, char* argv[])
{
    scanf("%d %d", &N, &K);
    
    int p1, p2, p3;
    for(int i=0;i<N;i++) {
        scanf("%d %d %d", &p1, &p2, &p3);
        a[i].score = p1 + p2 + p3;
        a[i].idx = i;
        a[i].state = 0;
    }
    sort(a, a+N, cmp1);

    for(int i=0;i<N;i++) {
        if (i < K) {
            a[i].state = 1;
        } else {
            if (a[i].score + 300 >= a[K-1].score) {
                a[i].state = 1;
            }
        }
    }
    sort(a, a+N, cmp2);
    for(int i=0;i<N;i++) {
        if(a[i].state) {
            printf("Yes\n");
        } else {
            printf("No\n");
        }
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://atcoder.jp/contests/abc228/tasks/abc228_c
