_posts/2021-12-18-abc228-c-upsolving.html
---
title: C - Final Day
tags: AtCoder
---

<div id="outline-container-orgca509f2" class="outline-2">
<h2 id="orgca509f2">C - Final Day</h2>
<div class="outline-text-2" id="text-orgca509f2">
<p>
3일까지 시험을 본 상태에서, 마지막 시험점수를 통해 K등에 들 수 있는지 알아보기
</p>
</div>
</div>
<div id="outline-container-org47b1671" class="outline-2">
<h2 id="org47b1671">코드</h2>
<div class="outline-text-2" id="text-org47b1671">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">score</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">state</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp1</span>(<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.score &gt; p2.score);
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp2</span>(<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.idx &lt; p2.idx);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;K);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>, <span style="color: #ff6347;">p3</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;p1, &amp;p2, &amp;p3);
        a[i].score = p1 + p2 + p3;
        a[i].idx = i;
        a[i].state = 0;
    }
    sort(a, a+N, cmp1);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (i &lt; K) {
            a[i].state = 1;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[i].score + 300 &gt;= a[K-1].score) {
                a[i].state = 1;
            }
        }
    }
    sort(a, a+N, cmp2);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span>(a[i].state) {
            printf(<span style="color: #ad7fa8; font-style: italic;">"Yes\n"</span>);
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            printf(<span style="color: #ad7fa8; font-style: italic;">"No\n"</span>);
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e9b047" class="outline-2">
<h2 id="org1e9b047">문제 링크</h2>
<div class="outline-text-2" id="text-org1e9b047">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc228/tasks/abc228_c">https://atcoder.jp/contests/abc228/tasks/abc228_c</a></li>
</ul>
</div>
</div>
